# HasObjStoryBound

## Description
Determine if the object has the specified story bound ID present.

```pascal
FUNCTION HasObjStoryBound(
				obj     : HANDLE;
				boundID : INTEGER): BOOLEAN;
```

```python
def vs.HasObjStoryBound(obj, boundID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object.|
|boundID|INTEGER|The identifier of the story bound.|

## See Also
VS Functions:
HasObjStoryBounds
| HasObjStoryBound
| GetObjStoryBound
| SetObjectStoryBound
| DelObjStoryBounds
| DelObjStoryBound
| GetObjStoryBoundsCnt
| GetObjStoryBoundsAt

## Version
Availability: from Vectorworks 2012

## Category
* Objects - Architectural